[{"title":"Starting Github Action Workflows From Observable","description":"A repository dispatch triggers Github Action workflows via an authenticated HTTP request. See the documentation on Github. From there you can do all kinds of things, even programmatically creating commits. In this notebook, we document two major ways to trigger actions from Observable authenticated, where notebook readers provide the access token to trigger a workflow pre-authenticated, where the notebook author configures a proxy using their own creds, so anybody can trigger workflows on the author's bless"},{"title":"Control Panel for Observable (Now with better responsiveness)","description":"Control Panel is a set of components to assist in easily building a compact and neat argument UI for visualizations. This is extremely useful when the chart has a large number of arguments. It allows the user to adjust all the arguments while simultaneously seeing the changes without the need to scroll back and forth. To get started, import controlPanel and Ctrls from \"@analyzer2004/control-panel\": Declare your Control Panel with <span style=\"color:#c30771\">viewof</span>: 🍰 Here is the cake you ordered 🍰"},{"title":"2021 Observable Community Recognition","description":"Observable is built as a space where those who work with data can come together to explore, analyze, discover and communicate with each other. Working with data and making sense of it is challenging, but with the contributions of you, the community, it is easier than ever to work together to make sense of the world with data. Our community inspires data collaborators around the world to collaborate, share, learn, and teach. Every day our community invents new and creative ways to explore and visualize data."},{"title":"Radar Chart","description":"Learning D3.js References Radar chart by Ben Welsh West Coast weather from Seattle to San Diego by Eric Lo Brand Personality Radar Chart by Jacob T. Fisher Imports"},{"title":"Efficient Responsiveness","description":"When notebook authors want to react to width changes, they often resort to Observable's built-in variable `width`. But having `width` as a dependency will cause all dependent cells to restart on every width change. This notebook wraps `window.matchMedia()` in a Generator, so that your code can react to only those changes that you're actually interested in. Context/discussion: How to change the cell width or listen for fullscreen mode? Import: Examples Note that the queries apply to the notebook's iframe, no"},{"title":"Hello, iro.js","description":"Iro.js is a design conscious color picker for JavaScript. See the documentation from their home page."},{"title":"Tour faces","description":"This notebook uses face-api to detect faces in a JPG or PNG image. You can then press the \"Tour faces\" button to take a tour of the detected faces in the image.  You can upload your own image or just try one of the   sample images. Code Parameters for image size Imports"},{"title":"Day 18: Snailfish","description":"You descend into the ocean trench and encounter some snailfish. They say they saw the sleigh keys! They'll even tell you which direction the keys went if you help one of the smaller snailfish with his math homework. – Advent of Code 2021, Day 18 Turns out you can do all of this as string operations. 🤯 See a previous version using way more complicated recursive tree functions."},{"title":"Day 17: Trick Shot","description":"You finally decode the Elves' message. HI, the message says. You continue searching for the sleigh keys. – Advent of Code 2021, Day 17 You miss  % of\nthe shots you could take. Opaque cells pass within the target, faded ones will\nmiss. Redder cells go higher. Hover the rainbow map to see the corresponding attempt below."},{"title":"Wrap Your Eye Around Rubik's Cube 👁","description":"Controls: A technique called ray marching is used to render the cube. Usually in ray marching, rays project out from a single point. Here, we don't just project rays in different directions, but we let them start at different points! The graphic below illustrates how the ray origins and ray directions change with the wrap factor. Scroll it to wrap! Implementation Notes to self: Here's a nice example of how to color objects in ray marching: https://www.shadertoy.com/view/fdlGWX Something about specular shadi"},{"title":"When Presidents Fade Away","description":"What are your thoughts on Chester A. Arthur? Was he a good President of the United States, or a bad one? Were you aware that he was a President? <figcaption>Chester A. Arthur</figcaption> According to a recent YouGov poll, the 21st President is the least known, with 27%  having never heard of him and 75% of those polled having either never heard of him or not knowing what they think of him. Which other presidents have escaped our collective memory? Here are the top 10 by the same metric, combining \"Haven't"},{"title":"Stencil all the things! Distributing circles around a shape","description":"Inspired by a tweet form Chris Gannon, I decided to explore this stencil effect by recreating it in a generative way. Instead of manually placing and colorizing each circle, I wanted to be able to dynamically generate them given any svg path. In this notebook we'll learn how use the svg APIs, sprinkled with some vector math, to randomly distribute shapes along any given path. Let's stencil all the things! Learning how to fish Now, in the end, this effect is pretty simple. If you think about it, it all comes"},{"title":"Truchet Archimedean Tilings","description":"Truchet tiles and periodic Archimedean tilings: this is my take on how to mix together these two pattern-making approaches. Wikipedia gives a nice intro to the subject of Truchet tiles, but you can find implementations of many cool variations right here on Observable. About Archimedean periodic tiles, the best reference you can find is José Ezequiel Soto Sanchez's PhD Thesis On Periodic Tilings with Regular Polygons. I've also written some Observable notebooks about the subject (see here and here). The demo"},{"title":"Day 9: Smoke Basin","description":"These caves seem to be lava tubes. Parts are even still volcanically active; small hydrothermal vents release smoke into the caves that slowly settles like rain. – Advent of Code 2021, Day 9 Part 2 Find the three largest basins. Starting from a low point (or really, any point in a basin), breadth-first search out from it visiting all its neighbors and keep going, stopping at any 9s. Use a FIFO queue(https://en.wikipedia.org/wiki/FIFO_(computing_and_electronics) and when it’s exhausted we’re done. For every"},{"title":"Future of Data Work: Q&A with Mike Bostock","description":"Mike Bostock has been busy. Our CTO and co-founder is the author of D3.js, an open-source library for data visualization which celebrated its 10th anniversary this year, and Observable Plot, a new library for exploratory visualization that builds on D3. Not to mention designing and developing features for the Observable platform. For this week’s Future of Data Work series, I sat down with Mike for a Q&A about his motivations and how he hopes people work with data in the future. Between your time as a graphi"},{"title":"Form Input / Observable Inputs","description":"The form input combines a number of inputs into a single compound input. It’s intended for a more compact display of closely-related inputs, say for a color’s red, green, and blue channels. You can pass either an array of inputs to Inputs.form, as shown above, or a simple object with enumerable properties whose values are inputs. In the latter case, the value of the form input is an object with the same structure whose values are the respective input’s value."},{"title":"The Most Frequently Used Emoji of 2021","description":"92% of the world’s online population use emoji — but which emoji are we using? Well, it appears that reports of Tears of Joy’s death are greatly exaggerated 😂. According to data collected by the Unicode Consortium, the not-for-profit organization responsible for digitizing the world’s languages, Tears of Joy accounts for over 5% of all emoji use (the only other character that comes close is ❤️ and there is a steeeeeep cliff after that). The top ten emoji used worldwide are 😂 ❤️ 🤣 👍 😭 🙏 😘 🥰 😍 😊. Th"},{"title":"30 days and as many maps","description":"A look back on the #30DayMapChallenge, 2021. Embarking on this challenge at the last minute was a bit stupid, but it felt like an opportunity to finish a few open projects, to try a few ideas, and to showcase a part of my usual toolbox. Day 1. Points. “Dotted Oceans” This globe uses: a backface projection that allows to “see through” the Earth, and a nice-looking random point distribution. Although it’s a very simple notebook, it was quite successful. Day 2. Lines. “World Cities Gabriel” Methods that can bu"},{"title":"Observable pour les géographes","description":"Depuis plus d'un an, je réalise des cartes et des visualisations de données avec Observable. Dans ce carnet, j'essaie d'expliquer ce que j'ai compris et pourquoi je considère que cet environnement est idéal pour créer des cartes. Je vais probablement améliorer ce matériel de présentation au fil du temps. N'hésitez pas à commenter et à suggérer des ajouts/changements. Commençons par une petite présentation introductive (Thanks Reveal.js). Ressources https://towardsdatascience.com/javascript-for-data-analysis"},{"title":"Pseudo-Blue Noise","description":"Blue noise is a noise color[1] that is particularly well-suited for image dithering purposes (see also [2][3]). Unfortunately it's also computationally intensive to generate. For example, Bart Wronski mentions that generating a \"64×64 wrapping blue noise-like sequence\" took \"a couple hours on an old MacBook.\" This was in 2016, but unless dramatic progress has been made in the algorithms to generate blue noise this will not be significantly faster today. What if instead of trying to generate proper blue nois"},{"title":"The Earth-Nose-Direction game","description":"How many friends can you find? SHARE! https://bit.ly/earth-nose-game code starts below Acknowledgments Notebook developed and edited by: @fil @mootari @radames Thanks for the fantastic feedback/ideas from all our ambassadors friends who almost broke their noses/necks testing the notebook. Notes Coins Sound Credits Face Mesh Model Card"},{"title":"GHSL — Growing and declining","description":"#30DayMapChallenge — Day 23. Global Human Settlement Layer. In this notebook, I’m discovering (a very small part of) the GHSL database, using Observable’s built-in tools: Inputs, SQLite and Plot. The result is the map below, showing the cities which have been growing fast since 1975 (in blue) and those that have been slightly declining (in red). The journey begins on the Urban Centre Database UCDB R2019A page. I download the big zip file to my computer, extract it, and see that it contains a file called GHS"},{"title":"Deriving Pantelleria","description":"#30DayMapChallenge — Day 21. Elevation. DEM This notebook starts with a Digital elevation model (DEM) of the Italian island of Pantelleria, halfway between Sicily and the coast of Tunisia in the Mediterranean Sea. I’ve never been there, but it looks like the perfect shape of an island… anyway… let’s begin. I captured this DEM on nextzen’s terrarium. The DEM is   pixels wide by   pixels high. For reference, it corresponds to the following projection (we won’t use it in the notebook). Each pixel of the image"},{"title":"Upset Plots with Observable Plot","description":"Venn diagrams can be used for comparing two or three sets. They give you an overview of intersection(s) of sets. However, when you have more than three sets to compare, Venn diagrams are not appropriate anymore. One way of visualizing intersections of multiple sets is an Upset Plot. We don't go into detail of how you read Upset Plots here, you can take a look at the official website or  paper. There are libraries for R (UpSetR) and JavaScript (UpSet.js) available for creating your own Upset Plots. The latte"},{"title":"Five Oceans","description":"#30DayMapChallenge — Day 18. Water. Attached to this notebook is a topojson file that I crafted more or less by hand. As I was trying to polish my “Born in Antarctica” notebook, I wasted quite a bit of time in an elusive search for a simple shapefile of the Antarctic Convergence. Unable to find a base map of the Oceans, I decided to create this one and add it to my toolbox. I arbitrarily selected the Antarctic Convergence to delimit the Southern Ocean, and prominent locations (keys, capes, islands, etc) for"},{"title":"Lucy mission animation","description":"This notebook contains the code for generating the animated diagram of <small>NASA</small>’s Lucy probe, which will visit many of the “Trojan asteroids”, a pair of clusters of asteroids at the Lagrange points of Jupiter’s orbit. You can read more about Lucy’s mission and see the complete animation in our article. The visualisation above shows one frame of the animation. Labels were added to the final video in AfterEffects, so this diagram has none. <span style=\"color:  ;\">Jupiter</span> is in red, <span sty"},{"title":"Macromap","description":"An interactive ‘small multiples’ visualisation for historical map collections. How can we get a handle on very large, partially-digitised collections of maps? We need a map of the maps. Macromap is designed to help researchers understand what map sheets the British Ordnance Survey (OS) made, when and where. In addition, it illuminates what’s been digitised: a lot, but not everything. The interface could also be used with other historical maps and map series metadata, and, more generally, to understand the s"},{"title":"Productionizing Observable Notebooks with 3rd party Active Monitoring","description":"I keep my 200+ public notebooks on the observablehq.com platform running by actively monitoring them with a 3rd party monitoring tool uptimerobot. Here is how I got it connected, and how I did it unobtrusively without altering the original notebooks. Broken notebooks are a big problem. I have encountered many broken notebooks on observablehq.com, and then much later, I have written many more. The thing is, I did not know my old notebooks were broken until I randomly checked! I don't want to host broken note"},{"title":"Future of Data Work: Collaboration and No Limits","description":"Imagine all the ways that data flows through an organization.  People explore and analyze data.  People ask critical questions of data.  All of these people bring diverse skills when engaging with data - data scientists, data analysts, data engineers, developers, product managers and decision makers. All of these people seek insights from data for decisions toward better business outcomes, but they all use a different set of techniques and tools to do their jobs. We can imagine those people with their tools"},{"title":"30 Day Map Challenge - Raster! ⊞","description":"World Happiness Index According to wikipedia Raster may refer to graphical techniques using arrays of pixel values The intention of course for today's #30daymapchallenge is to utilize an image or other-gridded-dataset that can be projected onto a map.  Raster graphics often highlight a level of detail that isn't easily achieved by coloring a set of polygons on a map. Today I'm taking a different approach though... The ultimate spirit of a `raster` is the idea that the data is fundamentally expressed in a gr"},{"title":"Day 11: 3D, 30 Day Map Challenge 2021","description":"https://data.linz.govt.nz/layer/50768-nz-contours-topo-150k/ This is a little slow load as it needs to extract the data files from a zip file. The contours Shapefile contains two types of geometry types, LineString and MultiLineString The Mouse can interact with the maps orientation. Add colours based on elevation,  there are   zones over a range of   to ✅ The objective here is to convert the contours of Taranaki into a three.js objects. ✅ Fix map orientation. <sub>(still seems broken as Y is where I imagin"},{"title":"Interval Transform / Observable Plot","description":"The interval transform turns a discrete value into an interval start, stop. For example, if value is an instant in time, the interval transform could return a start of UTC midnight and a stop of the UTC midnight the following day. The interval transform is most commonly used for “bar” charts of temporal data, where you in fact want rects rather than bars because time is continuous, not discrete. Consider for example the bar chart below of the trade volume of Apple stock. Because bars are used, x is ordinal."},{"title":"30 Day Map Challenge: Day 8 - Blue","description":"The Ocean blue This literally took about 15 minutes to build, in spite of the fact that I never used the drop shadow technique before. Why so fast? Because of Observable's template for a quick D3 World Map! Code"},{"title":"Interactive exploration with DuckDB: 5.2 million rows of college degrees in the browser","description":"I've looked in the past at in-browser analytics of a granular database of college degrees using basic Apache Arrow functions and arquero. This notebook does the same thing using the new duckdb wasm module. At first pass it's a cut above in speed and flexibility, because: It can load from compressed parquet files, which allow it to work with larger datasets, faster; It can often be about 10x faster than equivalent in-browser solutions if the data is more than several thousand rows. This means that you can cr"},{"title":"USSR, 1938","description":"#30DayMapChallenge — Day 6. Red. A map from 1938, highlighting the Soviet Union and Mongolia. Historic shapefile from this (defunct) thinkquest “GIS Resources for the Classroom” project. Inspiration for the colors and the projection (Mercator centered on Asia) is from one of Alex Radó’s maps."},{"title":"30 Day Map Challenge: Day 4 - Hexagons","description":"The new Electoral College The visualization below shows the apportionment of electoral votes based on the just released population counts diplayed as a tilegram. You can break the tiles apart or hover over them to figure out what's what. Code"},{"title":"Observable + GitHub 💞","description":"Visualizing data is more important than ever There are ~56M+ developers on GitHub and growing. As more developers collaborate, complexity increases. It’s easy for technical matters to consume all our attention, but are we asking the right questions? Is this the right data to be looking at? What are we trying to understand? How to we stay focused on insight? On thinking? How do we - all of us - shift our behavior in order to find answers together? Visualizing data is ONE of the ways we find answers together."},{"title":"Interactive BCG Matrix Component","description":"The BCG Matrix (aka Growth-share matrix) provides a strategic view for analyzing business units, products or services by splitting them into four quadrants according to the growth and relative market share: question marks, stars, dogs and cows. Each quadrant has its own set of unique characteristics that represents a certain degree of profitability. This helps companies decide where to focus their resources to generate the most value, as well as where to cut their losses. Below is a brief breakdown of each"},{"title":"Introducing SQL with DuckDB in your browser","description":"SQL is a declarative programming language transforming and querying data. It is declarative, meaning that you specify the data you want and not how the query should be computed. SQL is a great fit for a range of data transformation tasks including filter, sample, aggregation, window, and, join. SQL is the most popular query language for database management systems and essential to many business and data science workflows. It was the third-most popular language among professionals at the 2021 Stack Overflow"},{"title":"Dimensionality Reduction drawings","description":"UMAP and t-SNE are iterative dimensionality reduction methods. The picture gets drawn by drawing the voronoi cells of the intermediate results above each other with some opacity. Voronoi Cells Points Canvas Requires"},{"title":"How to build a naive wikification tool?","description":"Wikification or entity linking is a process of linking entities such as famous persons, locations or objects to the relevant Wikipedia pages. This tool identifies potential entities via the custom entities feature of winkNLP. It searches the potential entries in Wikipedia using its search API. Afterwards, it scans each set of result for the best match. If a match is found, tool links the entity to the matched Wikipedia page using the markup() method of  winkNLP. Wikipedia searches are online. There is an ad"},{"title":"Responsive grid","description":"Place views on responsive grid panels to create mobile friendly composite views quickly. Simple Uniform Coordinates... yet responsive The controls above are for building intuition over the coordinate system and grid parameters. Play with it! (you can instantiate it against your own grids too) Formally, there are n panels which rearrange to suit the screen resolutions. Typically three panels per row for desktop and 1 per row on mobile. On each panel is a uniform grid, typically 12 x 12, that keyed subviews c"},{"title":"State of Dataviz","description":"2021 Observations: Data through the lens of the Observable Community One of Observable’s motivating principles is to listen to and learn from its passionate and fast-growing community. Hundreds of our community members generously participated in two research surveys about data analysis and visualization over the past year. Here’s what we learned. Data is exploding, for everyone With the explosive growth in online technologies, services and information, data is overwhelming for all of us. Making sense of it"},{"title":"Sequencer","description":"The sequence connects to the drum pads which connect to the samples. You can mess with the speed of samples, hit the drum pads manually and play the sequencer program in real time! Connect a sample to a pad FastBtn Multi-touch, event raised on touch down for lowest latency Reactive border color and main color Colors"},{"title":"D3 Charts","description":"A guide to D3’s reusable example charts D3 Charts help you get started quickly with D3. To use these charts in your application, copy-paste or import the chart function into your code, then pass the chart function your data and any options. The chart function returns an SVG element that you can then insert into the page. The chart functions are designed to work out of the box: the options are all, well… optional, with reasonable defaults. For example, if you have a dataset that’s an array of numbers [x1, y1"},{"title":"D3 Charts","description":"A guide to D3’s reusable example charts D3 Charts help you get started quickly with D3. To use these charts in your application, copy-paste or import the chart function into your code, then pass the chart function your data and any options. The chart function returns an SVG element that you can then insert into the page. The chart functions are designed to work out of the box: the options are all, well… optional, with reasonable defaults. For example, if you have a dataset that’s an array of numbers [x1, y1"},{"title":"Color Input / Observable Inputs","description":"This input specifies an RGB color as a hexadecimal string `#rrggbb`. The initial value defaults to black (`#000000`) and can be specified with the value option. The color input is currently strict in regards to input: it does not accept any CSS color string. If you’d like greater flexibility, consider using D3 to parse colors and format them as hexadecimal. If you specify the datalist option as an array of hexadecimal color strings, the color picker will show this set of colors for convenient picking. (The"},null,{"title":"Color Input / Observable Inputs","description":"This input specifies an RGB color as a hexadecimal string `#rrggbb`. The initial value defaults to black (`#000000`) and can be specified with the value option. The color input is currently strict in regards to input: it does not accept any CSS color string. If you’d like greater flexibility, consider using D3 to parse colors and format them as hexadecimal. If you specify the datalist option as an array of hexadecimal color strings, the color picker will show this set of colors for convenient picking. (The"},{"title":"🔮Bubble Matrix🔮 Component","description":"A Bubble Matrix is a two-dimensional representation of information with the help of sizes and colors. The chart is visualized like a matrix with a finite number of rows and columns. Bubbles within the matrix are categorized by two different colors depending upon the segment in which the data value they represent belongs to. Bubble matrix can be useful in helping users to gauge above or below ranges quickly, as well as spotting the most important values by using the highlight feature. Features Sort: When you"},{"title":"Hello, CodeMirror 5!","description":"Demo Stuff"},{"title":"What's That Noise?","description":"A closer look at various types of 2D noise and how to massage their output. Move your cursor over a noise field (or click/tap) to update its line. (Note: currently not optimized for narrow screens. If you're on mobile, please switch your phone to landscape.) Perlin & Simplex Noise Worley Noise Helpers Noise UI Dependencies"},{"title":"Analyzing Time Series Data","description":"Approaches for working with data that changes over time Many of us work with data that is about time, tracking fluctuations by hour, day, week, month, etc. We need to know what caused a spike or dip, learn why the actuals diverged from the forecast, characterize typical daily, weekly, and seasonal patterns, or see how the correlation between two metrics depends on time. In this collection of stories we share how we've looked at a “mountain of data” about energy production in the United States and the signal"},{"title":"Assignment #4","description":"Tyler Hobbs Color Arrangement in Generative Art GRADIENT: change the saturation/hue/value/brightness; CLUMPING SORTING / SEQUENCES: begin by generating a lot of colour selections, and then sort them by some attribute like hue. COLOR SAMPLING / MAPPING INHERITANCE: subdivision, recursion, or some other parent/child relationship. For example, if the parent shape has a red colour, then any children of that shape have a high probability of being red as well (along with a low probability of changing to a new col"},{"title":"Wolfram Alpha in Observable","description":"This library lets you embed answers and demonstrations from Wolfram Alpha into your notebooks. Setup You don't need an app ID if you only want to embed demonstrations: To fetch answers, get an app ID from the developer portal and `import with` it: See @observablehq/secrets to learn more about secrets. A demo ID is used here for documentation and examples, but it will eventually hit the API's query limit. Secrets in shared notebooks If you can't or don't want to type `Secret()` for your app ID when importing"},{"title":"What’s new in Observable Plot (0.2.7)?","description":"For more on the latest releases, please see our Changelog. Plot now allows you to inspect scales! Rendered plots (either SVG or figure elements) now expose a plot.scale(name) method that returns an object describing the scale in-use, including any materialized defaults. For example, say you made a scatterplot showing the rise of global surface temperature anomaly using a quantile color scale. To retrieve the color scale for this plot, call plot.scale passing in the name “color”. The returned object will sho"},{"title":"Map Projection Playground","description":"Adapted for my course \"Cartographic and Geodetic Foundations for Planners\". You can find even more static examples map projections in this overview. Map Style: ⚠️ This causes rendering errors for some projections: For some interrupted projections, you can set the number of lobes: 1 The circles for visualizing distortions are taken from here. This is not actually a true implementation of Tissot's indicatrix, which would require to compute partial derivatives of the projection function at the indicated points"},{"title":"Lawson's Klein Bottle","description":"Based on the equations described in Lawson’s Minimal Surfaces and the Sudanese Möbius Band. This notebook is modified after receiving some help from Dan Piker in this notebook which is in turn a modification of my original attempt, after inspiration by Dan Piker's tweet, \"I also really want to get better at putting this sort of thing online in an interactive way.\" We start with a generalization of a Clifford Torus in 4D space.   below is a parameter of this surface, while   applies a four-dimensional rotati"},{"title":"Hello, Open Meteo","description":"Open Meteo’s APIs accept standard WGS84 coordinates and return a weather forecast<br>for 7 days in hourly resolution. API documentation; see HN discussion (thanks, Job!)"},{"title":"Ink in water","description":"Using @jashkenas's port of Pavel Dobryakov’s WebGL-Fluid-Simulation (MIT License) as a base, an ink model. Our long term destination is Suminagashi, but we need multi-fluid simulation to model the surfactant. The main changes from @jashkenas we add pressure with the splat function to make the ink shoot outward continuous mouse controls inverted the color mixing model to be subtractive (which is more like ink). rotating ink color Checkout Gentle Introduction to Realtime Fluid Simulation for Programmers and T"},{"title":"How to make a nice scale bar","description":"Here are some hints to make a scale bar with nice rounded values and divisions, for a map. Usually, a scale bar has to fit within a rectangular component, with limited dimensions. It is unlikely that the scale bar length corresponds to a nice rounded value (such as 100km) which can be easily divided into other nice values (such as 25km, 50km, 75km). In such case, it is more suitable to shorten a bit the scale bar to a lower length value which makes it nicer (see here for example). This page gives some eleme"},{"title":"Learning Observable Plot via Altair","description":"Between 2018 and 2020 I was actively involved with the <a href=\"https://altair-viz.github.io/\" target=\"_blank\">Altair</a> community, creating many examples for the documentation and gallery. It was the first time I had used a visualization library inspired by a layered <a href=\"https://www.amazon.com/Grammar-Graphics-Statistics-Computing/dp/0387245448\" target=\"_blank\">grammar of graphics</a> and it was an eye-opening experience. Learning to use Altair, and understanding the <a href=\"https://vega.github.io/v"},{"title":"PLOTting Interactive Stock Chart","description":"Plot with a little help from D3 (tweaks and tricks), the limit is your imagination!! Hover mouse over the chart to see some magics.🌟✨ Data Source: Nasdaq - TSLA Historical data (2021/09/03) 🚗📈 🌐ericlo.dev 🐱GitHub Repositories 🐦Twitter"},{"title":"Time Series Data Smoothing","description":"Fetch the Data We'll use daily covid cases in the U.S. from CovidActNow as our data set: Here's what daily cases look like: 7-Day Rolling Average 7-day rolling averages are simple to calculate and smooth out cyclical weekly inconsistencies. You simply take all values from the past seven days and average them. This works well for covid case counts because it smooths out reduced reporting on weekends. You can use a window size other than seven for the rolling average—for example you might use 24 if your sampl"},{"title":"Visualizing Seasonal Daylight","description":"Everyone who lives away from the equator knows how the days lengthen and shorten throughout the year. We hear about the long dark polar winters, and the endlessly looping sun of the polar summer. Many people might be able to toss out the answer to these natural phenomena, \"because the Earth is tilted,\" but in my experience far fewer intuitively grasp the geometries involved. I developed this tool to help my children interactively investigate how the Earth's tilt changes the length of day for different locat"},{"title":"WEBcode.run","description":"** Rapid HTTP endpoint development featuring production debugging, instant deploys** and Observable browser based tooling. Do you like the idea of Serverless functions-at-a-service but find the sheer pain of development is actually worse than the operation complexity it displaces? Do you empathize with the following:- The local tooling is confusing, inconsistent with prod and takes too much effort to setup? The deployment cycle is too slow? The lack of debugger is like coding blindfolded? If you answered ye"},{"title":"Plotting Ben’s Google Fit Data","description":"Note: This is a response to Ben Doherty’s notebook. Thanks for sharing your notebook and data, Ben! Here are a few tips on using Observable Plot. I hope they are helpful. My first tip is to type your data, preferably when you load it. Data types—such as ordinal, temporal, and quantitative—are critical concepts in visualization. Observable Plot infers data types from values; if you pass Plot strings, it’ll assume your data is ordinal or categorical (e.g., names), which is often not what you want. You have qu"},{"title":"Ping chart","description":"In this notebook, I attempt to create a dynamic line chart that tracks latency time series data of a hypothetical network.\nThe chart visualizes smoothly incoming raw latency and the popular p50, p90 percentile typically found in software engineer operational dashboard. You can move your mouse across the chart to get the tooltip of a particular point. You can also use the mouse wheel to zoom in and out. To start animating incoming new data, press the `Play` button. Configuration Here's the following configur"},{"title":"Foggy City Sunset","description":"Inspired by San Francisco via a sweatshirt designed by Nathan & Angela Waak"},{"title":"Synchronized Map Input","description":"An answer to this forum question. Based on the Custom Input Example and the Synchronized Inputs notebook. To change the state either click on the map, or select from the drop-down. Map data and setup"},{"title":"World of squares","description":"On this map, each country is represented by the largest square inscribed in its (projected) contour. Should we call this a Toeplitz cartogram—after the mathematician Otto Toeplitz who proposed the inscribed square problem in 1911? For more inscribed shapes fun, see KDO’s variant with circles, and a version with spherical geometry."},{"title":"Photo to 3D RGB Model","description":"A very interesting way to visualize the transformation from pixels to 3D RGB model using three.js. Hit the play button or drag the slider back and forth, either way is a fun way to watch.😀 Pixel Calculation RGB Plot three.js Objects Cameras and scenes OrbitControls Renderer Photo Credits Photo 1 - Yamanaka Tamaki, Photo 2 - Ann, Photo 3 - Frank-3 🌐ericlo.dev 🐱GitHub Repositories 🐦Twitter"},{"title":"Observable Plot: Q–Q","description":"A quantile-quantile plot compares two distributions. If the two are similar, the points will fall approximately along the diagonal; if not, the points will deviate from the diagonal, revealing differences. This example compares the strengths of two batches of ceramics: the first appears to be significantly stronger. Data: NIST Per NIST: “If the data sets are not of equal size, the quantiles are usually picked to correspond to the sorted values from the smaller data set and then the quantiles for the larger"},{"title":"Building a Better Beeswarm","description":"Beeswarm plots are a fun, visually pleasing alternative to histograms that can be used when data is sufficiently small and you want to plot every point. This notebook contains an algorithm for accurate beeswarm plots with circles that vary in radius, using a simple implementation of this algorithm by James Trimble. In addition to being faster to compute than a force-directed layout, it has the advantage of improved accuracy since it preserves the precise x position of each data point. Visualizations of the"},{"title":"Plot Animation","description":"Animations can drive focus and reveal insights when used intentionally, as in this heatmap of measles cases per capita over time: To add your own animation to your Plots for storytelling or visual flare, set the desired visibility attribute (e.g., `fillOpacity`, `strokeOpacity`, `r`) to 0 in the plot, and pass the plot to the `addAnimation` function: For example: animate women astronauts over time, from this awesome project. You can also set multiple options on the animation, including: `type` of mark to an"},{"title":"Book cover visualization","description":"Maybe, I thought to myself, I don't need to \"generate spines\" at all. Maybe I can just use the actual book covers, which would be much easier and probably end up looking better. I need to add something to test if there's no cover data and skip it, like I do in the Spine Generator version Get the data I've finally transferred all my book data to Open Library THANK GOD. Now I can use their APIs to get my to-read, read, and currently-reading books. Clean up data Imports"},{"title":"Hello GlobeletJS","description":"GlobeletJS is a light-weight renderer for vector maps. It inputs a MapLibre style document, renders a standard flat map in Web Mercator projection, and then reprojects it to a globe using robust raster reprojection. Here is a quick example using a style and tileset from MapTiler. Try zooming in to your hometown! How to use it Like Leaflet and MapLibre GL JS, GlobeletJS requires both JavaScript and CSS files. The JavaScript can be imported from NPM: And the CSS is available from the unpkg CDN: Next we need a"},{"title":"PM2.5 to AQI Conversion","description":"My home weather station measures PM2.5 concentration in micrograms per cubic meter (μg/m³). But if I’m concerned about air quality, I want to know the Air Quality Index (AQI). AQI is a policy tool and as such has a complicated definition. So, here’s a tool to convert between PM2.5 and AQI (assuming that PM2.5 is the only pollutant you care about). Drag either slider below to choose the selected PM2.5 or AQI. The cell below defines the six official Air Quality Index (AQI) categories: “Each category correspon"},{"title":"Flipping a Card","description":"<span style=\"color: darkgreen\">Objective: this is a step-by-step breakdown of creating a flipping card. UI element. These are frequently used for question & answer activities or to provide additional details to a topic.</span> First, create a basic card object. Create a content placeholder. This should fill the entire card. Move `.centered` and `.bordered` down from the card to the content. Add the front and back to the content. The back is on the front because we haven't created any transforms yet. Apply t"},{"title":"Latitude and longitude precision","description":"How many decimal digits do you need for longitude and latitude? Following the famous XKCD comic on coordinate precision, let's see how this looks on a map. There's a location defined at the bottom of this page, but we've rounded the coordinates to integers, losing all precision. Now it looks like ** ,  **. Where could it originally point to? The map below shows the exact area of all locations that round to these numbers. So, with zero decimal digits, we can place the location somewhere around London. What i"},{"title":"Data Wrangler","description":"Data wrangling is often a complex and time consuming part of quantitative work.\nThis (experimental) `Wrangler` function provides an interface to guide code\ncomposition and also display the results. It uses the\nArquero package, a\nrobust data wrangling library based on the grammar of data manipulation. To get started, import the `Wrangler` function from this notebook: Then, pass your data into the `Wrangler` function, and access the results: As an example, here is an exploration of U.S. protest data\n(source)."},{"title":"Flow fields","description":"An attempt to reproduce some of the techniques described in Tyler Hobbs' Flow Fields post. A simple field A more interesting field Curves through the field Position sampling Perlin noise fields Colored Perlin fields The idea here is to set the color of each flow curve to the color picked from a \"seed\" image."},{"title":"The Three-Body Problem","description":"choose a system and wait for the chaos"},{"title":"Creating custom data visualizations using ✨ D3.js ✨","description":"❓ Why learn D3.js? ❓ What can I make with it? ❓ How do I get started? Here's an overview of the different modules: https://wattenberger.com/blog/d3 It just takes 7 steps to make any viz: Access data Create chart dimensions Draw stage Create scales Draw data Draw peripherals Set up interactions Full code example: https://codesandbox.io/s/d3-scatterplot-p6s5z?file=/src/index.js Step 1: Access data Getting our dataset Bonus step: 👀 Looking at our data 👀 Example: https://observablehq.com/@wattenberger/explora"},{"title":"Covid Acceleration in the U.S.","description":"Based on A new way to visualize the surge in Covid-19 cases in the U.S. by Emory Parker Data from the COVID-19 Data Repository by the Center for Systems Science and Engineering (CSSE) at Johns Hopkins University A projection is shown by extrapolating from the latest jerk value. This is not an epidemiological model. Total Cases Total confirmed Covid cases in the U.S. Case Velocity New cases per day Case Acceleration Change in new cases per day Case Jerk Change in change in new cases per day"},{"title":"CyclePlot w/ Energy Data","description":"This is a fork of Eric Lo's fantastic Box Plot Chart view of Mike Bostock's energy usage heatmap. I've forked it to also add a cycleplot to the analysis. And, then I kept going... This text & chart below forked from Eric  \nDo you recognize this Box Plot Chart? It's a legendary piece from Dundas Chart Enterprise Edition which dates back to about two decades ago (the JPEG + image map dataviz era). This remake is done by using Observable Plot, demonstrates how easy you can achieve such a complex visualization"},{"title":"Interpolators","description":"Libraries used"},{"title":"Eval-in-Place","description":"Sketching, wishing for code expansion When we were walking to the last bar I went to before the first San Francisco coronavirus lockdown, my friend Morgan told me how Excel has this amazing   shortcut (Exceljet demo); typically it recalculates the sheet, but it also lets you stick a probe into a larger expression by showing the value of a selection within it (which also lets you bake it in if you please). Unlike `console.log`, it’s just one keystroke and appears inline and already selected, so it’s easy to"},{"title":"CSS Variables #1: Basics","description":"CSS variables is a native way of creating ... variables in CSS! Their official name is actually “CSS custom properties” and they have been supported by all modern browsers since at least 2017. Unlike preprocessors variables, CSS custom properties have access to the DOM. A consequence of that, and the greatest advantage of them over preprocessor variables, is the possibility of declaring values that change based on media queries. More on that later. For now, let’s take a look at the basic syntax for declarin"},{"title":"CSS Variables #1: Basics","description":"CSS variables is a native way of creating ... variables in CSS! Their official name is actually “CSS custom properties” and they have been supported by all modern browsers since at least 2017. Unlike preprocessors variables, CSS custom properties have access to the DOM. A consequence of that, and the greatest advantage of them over preprocessor variables, is the possibility of declaring values that change based on media queries. More on that later. For now, let’s take a look at the basic syntax for declarin"},{"title":"Mixed Integer / Linear Programming","description":"Mixed integer programming for the browser! Mixed integer programming is restricted but powerful formalism for solving optimization problems. Variables can be non-negative continuous (default) integer binary (which is integer restricted to 0 or 1) You can request to minimize or maximize some linear objective function e.g.  . Note the main linear limitation is you cannot multiply variables.  The solver will then find a solution that is optimal for your objective (though may take a long time). This solver fron"},{"title":"Journal articles in Crossref with open references","description":"Articles in Crossref with deposited references Availability of references deposited in Crossref Publishers depositing closed references Publishers depositing limited references Publishers depositing articles without references"},{"title":"Hello, citation-js!","description":"github.com/larsgw/citation.js Paste one or more DOIs, or other identifiers into the input textbox and this notebook will display the citation(s) as text and bibtex. Beware of errors, always double-check the data! Citation References"},{"title":"Processing https://10print.org/ (p5.js)","description":"Get started with creative coding. Learn more in the tutorial."},{"title":"Scaling User Interface Development","description":"Backend development is rapid, and yet... custom user interface development is still a huge timesink. UI development is a project bottleneck. This living document is a growing list of techniques I have learnt trying to overcome the UI development bottleneck. When I create complex applications, I need contextually sensitive user interfaces. However, building these custom UIs felt like starting from scratch everytime and the effort required was too high! So I embarked on a journey, distilling the learnings tak"},{"title":"The story of Observable on Twitter","description":"** Main info** 📝 forked integration notebook: Google Sheets Starter ℹ️ dataset: the Observable twitter activity up to (and updated to) 🗓    (source: Twitter API) 📗 Data are hosted in a Google Sheet and published as a csv file Once Upon a Time... ✨✨✨ 💫 Welcome to the data story of Observable on Twitter. Every story has a beginning... Do you remember this? Back in 2017, that was the first \"official\" Observable tweet, and it has been liked   times 💙 (as of `2021-07-26`). But to be more precise, the very f"},{"title":"Let's make an extruded map","description":"1. Data Import & handling **2. deckgl ** ** Dependencies**"},{"title":"Plot for mathematicians","description":"Observable Plot is a free, open-source library from the folks at Observable designed to make it easy to generate many common types of charts for the visualization of data. The documentation is extensive and generally excellent. It's (understandably) focused on its usage with data, though, which obscures how easily it can be used to generate nice mathematical plots. The purpose of this notebook is to illustrate how we might use it to generate simple graphs of functions. \\`Plot\\` basics One of the most basic"},{"title":"Box Plot Chart","description":"Do you recognize this Box Plot Chart? It's a legendary piece from Dundas Chart Enterprise Edition which dates back to about two decades ago (the JPEG + image map dataviz era). This remake is done by using Observable Plot, demonstrates how easy you can achieve such a complex visualization with relatively lesser lines of code. The chart itself visualizes the dataset from Mike Bostock's <b>Electricity Usage, 2019</b> notebook in hourly view. As he described - <b><i>\"During sunny days in the summer, my home’s s"},{"title":"Aliasing","description":"This tweet shows the phenomenon of aliasing  through a very effective animation. The notebook port here provides a little bit of interactivity so you can explore what happens when a signal is not sampled often enough in a reconstruction: A well-sampled signal must be sampled at least twice as often as the highest frequency in the original signal. It's not obvious yet always possible to reconstruct a signal exactly if it's been sampled at a sufficiently-high rate. A signal sampled less frequently than that w"},{"title":"039 Deformed Rectangles","description":"Original artwork: 201216a by Okazz"},{"title":"Random Chess Simul","description":"Configuration data helper functions dependencies"},null,{"title":"Notebook Visualizer for Teams","description":"To use, paste the URL of a public or shared notebook below, or type and click submit. For more on what this graph means, see How Observable Runs. Use the cell menu <svg viewBox=\"0 0 8 14\" fill=\"currentColor\" stroke=\"none\" stroke-width=\"1.5\" stroke-linecap=\"round\" stroke-linejoin=\"round\" width=\"8\" height=\"14\"><circle r=\"1.5\" cx=\"4\" cy=\"2\"></circle><circle r=\"1.5\" cx=\"4\" cy=\"7\"></circle><circle r=\"1.5\" cx=\"4\" cy=\"12\"></circle></svg> below to save your graph as PNG or SVG if desired. To share a link to your de"},{"title":"GitHub Stargazer History","description":"GitHub shows you how many people have starred a repository, and who they are. The website doesn’t show when they starred the repo, but the API does. We can use this to show a history of the number of stars a repo gets over time, with tagged releases labeled for context. This example shows who’s starred Observable Plot, but you can change it to any repo. To increase your rate limit or show private repos, authenticate with GitHub. How to authenticate with GitHub Getting the stargazers for just one repo can re"},{"title":"VISVAR Publications & Authors","description":"Publication Table This table contains all the data used in this notebook. Of course it is hard to get much information fom it, that's why visualization is such a useful tool! **Selected publications:  ** Publications over Time A simple visualization would be a bar chart of the number of publications made in each year: publication from VISVAR Members In the following visualizations, colors help to distinguish VISVAR members from each other and from third-party authors. Publication Graph Each node is a public"},{"title":"How Has Men’s Tennis Changed From 1973–2021?","description":"Like elite athletes in other sports, male tennis players are getting taller and heavier every year. The one-handed backhand, once ubiquitous in tennis, is now on the endangered list. There are even some interesting trends on left handers since 1973. This article analyses all of the above, but before diving in, let's look at how the top countries have shifted over the last 49 years. Top 6 Countries of Male Tennis Players in the Top 100, 1973–2021 Australia and the USA were once the undisputed leaders in men’"},{"title":"Converting Between Keyboard Layouts","description":"This notebook offers a workaround for encoding issues when pasting text into web based server consoles. If you manage remote server instances, you may have encountered web based consoles for terminal access. Using these consoles is unavoidable sometimes, even though they are often awkward to use – especially with non-US keyboard layouts. While input issues can be worked around by temporarily switching to a US keyboard layout, the same may not be true for text pasted from the clipboard: Here you can still en"},{"title":"Tree Input","description":"Observable has a lovely default tree inspector for hierarchical data: But you can’t select a child and refer to it in code. With this you can: Options: children: accessor; defaults to `d => d.children` name: function returning string or DOM node; defaults to `d => d.name` open: number of levels to default to open; defaults to 0 value: initial value; defaults to root Implementation"},{"title":"🌍 Visualize Sophie's World by AntV","description":"\"Sophie's World\" is a famous novel, offers a summary history of philosophy embedded in a philosophical mystery disguised as a children's book but only sophisticated young adults would be remotedly interested. It tells a story about a girl named Sophie Amundsen who receives a letter from a philosopher named Albert Knox and then begins her journey to learn philosophy. During thier education, they gradually find they are in a book which means their whole world is just the world described in the book. The funda"},{"title":"Reusable Flower Plot","description":"Put your data in flowers! 🌼 🌸 -- <cite>Anonymous</cite> This notebook describes the \\*Flower Plot\\*, a dataviz that lies somewhere between stacked normalized charts and pie/donut charts. Let's see some flowers in action: 🌻 In each Flower Plot: each petal represents a data category, like slices for pie charts or bars in bar charts the extension of each petal (i.e., start / stop angles) represents a proportion of the whole (like slices in pie charts) (optional) petals can be colored with different stacked"},{"title":"Local Spatial Autocorrelation Interactive Tutorial","description":"Text in this notebook is adapted from Luc Anselin's GeoDa workbook, available here. GeoDa is a free and open-source program for exploratory spatial data analysis and basic spatial regression modeling that you can download here. When we look at maps, we spot concentrations and groupings of high and low values, start to recognize patterns, and construct stories about what might be going on. But how can we statistically measure where hotspots and coldspots really exist? This is where local spatial autocorrelat"},{"title":"Generative Loop template","description":"Clear params Permalink to this composition Imports"},{"title":"Black Widow: Pay for premier access?","description":"Black Widow is available now on Disney+ for early access for $29.99. It becomes generally available to all subscribers on October 6, 2021. How much value am I getting per day when I pay for early access? Let’s define value as: how many days do I get to enjoy it before others can. So, what’s the $29.99 cost amortized over the remaining days? a.k.a., Can I justify paying today and not feeling guilty about it? Yes, yes I can. I realized after looking at the numbers this progression is… geometric? So, a line ch"},{"title":"Search Checkbox 🔎☑","description":"An useful input control for when you want the user to be able to select quickly from a long list of elements. Supports: Select elements individually Search for specific elements Select/Deselect all the currently filtered elements Usage: It tries to follow these best practices for Observable Inputs, and it is built by simply combining a Search and Checkbox Observable inputs. The second parameter is an option object that will be passed to these two components. Compared it with my old multiAutoSelect, the sear"},{"title":"Data Editor","description":"Reorderable, editable, selectable, table of views that is also backwritable. Thanks @jashkenas/select-order-input for figuring out the tricky drag business. Example Open Issues does not play well with shareview, see repro (more shareview's issues) selection breaks for no good reason (and is not backwritable anyway). You can add add/delete rows by assigning to the data subview. This can be useful for external input forms to add/remove elements. Note it does not raise an input event itself"},{"title":"Getting routes with OSRM","description":"The distance between   and   is   km. It takes   hours to cover this distance by car. OSRM (Open Source Routing Machine) is a C++ implementation of a high performance route search engine to obtain the shortest paths in a road network. Available under a simplified BSD license, OSRM is an open source service. See http://project-osrm.org/docs/v5.24.0/api/ Preliminary remarks: To query the OSRM API, you need to have CORS enabled. For that, you can use CORS Anywhere Observable. All explanations here: https://git"},{"title":"Happy anniversary, Project Gutenberg!","description":"Project Gutenberg was founded on this day 50 years ago by Michael S. Hart. Gutendex is an API that can be used as en entry point to this amazing collection of more than 60 thousand free eBooks curated, scanned and cleaned-up by volunteer effort. Here are the most downloaded books from the collection: Select a book title to see a cloud of its most used words: code"},{"title":"Hello, spatialmerge","description":"spatialmerge is a (relatively) fast library for spatial joining and merging data in JavaScript 🚀 This notebook will walk you through different ways to combine spatial datasets. It is a (blatant) copy of the \"merging data\" tutorial from geopandas, and uses the same underlying datasets. Merging data There are two ways to combine datasets in `spatialmerge` – attribute joins and spatial joins. In an attribute join, a GeoJSON feature collection is combined with an array of objects (e.g. the contents of a CSV fi"},{"title":"Draggable LocalFile fileInput","description":"A combination of @fil/fileuploader and @mbostock/localfile for a draggable file input that has all the convenience methods of a FileAttachment (e.g. .json()) and has a hover effect. Quite a good example of how much nicer using the view literal is. I have not added many options, but Suggestions are welcome. Usage:"},{"title":"The Sun’s analemma","description":"If you were to look at the sky every   of the year at the exact same hour, where would the Sun be? The diagram below shows its position for each hour of the day, limited by the horizon. Each twisted loop (called an  analemma), is in fact made of   dots, one for each   of the year. The analemma shows by how much solar time is fast or slow compared to clock time, at different periods of the year. Click on the map to set the observer’s location (defaults to Greenwich). This diagram is facing North if the obser"},{"title":"The Titanic disaster: a neat synthetic view","description":"Bruce Gabrielle has designed an original and synthetic representation of the famous Titanic dataset. He presents a refined \"spineplot\" in his gripping book Storytelling with graphs. Data: Robert J. MacG. Dawson\nborrowed from the Parallel Sets example. As Bruce explains, with this design, the story is faster to understand: There were relatively few children onboard that night There were about three times as many men onboard as women The majority of women were saved The vast majority of men did not survive Th"},{"title":"Equal-Area Radial Matrix of LGBT Rights","description":"In Why use a radial data visualization?, I wrote about some of the pros and cons of choosing a radial layout for time series, categorical, or hierarchical data. I left out matrix/heatmap data, though—so for Pride month, here’s a partial re-creation of a radial matrix visualization I love, The Guardian’s Gay rights in the US, state by state (whose scope covers both sexual orientation and gender identity, despite the title). The original was designed by Feilding Cage in 2012, who wrote a blog post about the p"},{"title":"The Fast Saga","description":"Yesterday (June 22nd, 2021) was the 20th anniversary of The Fast and the Furious, the 2001 street racing epic that started the silliest, most outrageous, and fastest movie franchise of all time. As a longtime fan of Dominic Toretto's antics, and on the eve of F9: The Fast Saga, I thought I'd whip up a few data visualizations about the franchise. This data was compiled by hand from IMDB and rotten tomatoes. Anyone familiar with the series knows that its one of the rare cases where the movies actually get bet"},{"title":"Try D3 Tree Visualizations","description":"Try different D3 Tree visualizations with your own data. 1. Upload your data Here is some movies data as an example. But you can upload your own CSV or JSON file with the button below 2. Group by attributes 3 Choose your visualization"},{"title":"localStorageView: Non-invasive local persistance","description":"Lets make it simple to add local storage to a UI control (e.g. @observablehq/inputs) We exploit back-writability and input binding to avoid having to mess with existing UI control code. localStorageView(key) creates a read/write view of a safe-local-storage. Because it's a view it can be synchronized to any control we want to provide persistence for. We avoid having to write any setItem/getItem imperative wiring. If you want all users to share a networked value, consider shareview. This works with an view t"},{"title":"Morse code trainer","description":"Use the button below to practice your Morse code. Sound on 🔊. Once you’ve focused the button by pressing it, you can also use the spacebar. If you’re finding it difficult to encode a dah (a.k.a. dash −), try adjusting the dit (a.k.a. dot ·) duration. Built with <img src=\"https://avatars0.githubusercontent.com/u/841829?v=4&s=48\" style=\"border-radius: 100%; height: 24px; vertical-align: middle;\" /> @tophtucker while streaming. Let us know if you have any ideas to add to our list or want to join a future stre"},{"title":"Summary Table","description":"Want a quick visual overview of a dataset? To get started, import the new (experimental) `SummaryTable` function from this notebook: Then, pass your data into the `SummaryTable` function. As an example, here is a summary table of the Penguins dataset (described in detail here). You can also upload your own data using this button: The values calculated are exposed as a view and can be used as you like: For example, you could then create a separate plot of the percentage of missingness of each column: Impleme"},{"title":"EU Fishing Flow","description":"Data Helper Functions Scales Dependancies"},{"title":"📊 How to write a mini plot library?","description":"This article is going to show how to write a mini plot library from 0 to 1. It is very interesting because it will not use any third party library during the whole process. Happy crafting! The main task for plotting a chart in data visulization is to map abstract data into visual representation, in other words is to determine some visual channels (position, color, size, etc.) of each mark (dot, circle, rect, etc.) by corresponding dimensions of data. Some low-level library such as D3 allows users to directl"},{"title":"G2Plot 2.3.23 Released 🎉","description":"G2Plot is an interactive and responsive charting library based on the grammar of graphics, which enables users to generate high-quality statistical charts through a few lines of code easily. G2 in \"G2Plot\" means the grammar of graphics and pays homage to ggplot2. What's New in G2Plot 2.3.23 We've added two new plot types: `Facet` and `Violin`, support `localization`, enhance several plots, like `Sunburst`, `Stock`, `Heatmap` and `Box` and so on. Learn more about details in Version History, try it and enjoy"},{"title":"All the passes ⚽️","description":"A visualisation of 882,536 passes from 890 matches played in various major leagues/cups such as the Champion League 1999 FA Women’s Super League 2018 FIFA World Cup 2018, La Liga 2004 – 2020 NWSL 2018 Premier League 2003 – 2004 Women’s World Cup 2019 Data provided by StatsBomb Original inspiration: Alexander Varlamov's blog post Data Dependencies"},{"title":"Density contours with linear binning","description":"new in d3-contour@3 and d3@7! This brownian motion system with   particles is visualized with the contours from d3.contourDensity. The first chart uses the traditional nearest neighbor method; the second chart shows the improved method—linear binning—adopted by d3-contour@3. Density contours are calculated in three stages: first, each of the data points registers its weight onto a grid. The total weights on that grid are then blurred, and contours are computed. With linear binning, the weight of a point is"},{"title":"Building a Parametric Seashell","description":"The clam and the conch seem to be drastically different creatures. One spends its life burrowing in the sand, staying in one spot to glean nutrients from the water. The other constantly vaults itself around the seafloor to find its next meal. One has a gently curving, sand-colored shell, whereas the other has a shell spiking and spiraling and splaying out in the colors of the sunset. These two species are opposites in many ways, yet the same equation underlies both of their shells. In fact, find any mollusk"},{"title":"PlotX3D","description":"Several tools have been developed on Observable to make it easy to create two-dimensional, mathematical plots, like: Funplot, Plotter, and Function Plot. Those all provide a simple, declarative syntax to leverage more complicated tools like D3 to manipulate a canvas or SVG. In a similar vein, I've developed a collection of simple declarative tools, built on top of D3 and X3Dom, that make it relatively simple to generate mathematical 3D graphics. Thus, we can use two of the tools from the PlotX3D bundle to p"},{"title":"Peeking into the Gaia Star Catalog","description":"The Gaia Project is an ambitious mission to take a detailed \"census\" of our Milky Way galaxy, including the positions, color, and radial velocities of over a billion stars. Let's take a look at some of this data! Warning: I am not an astronomer, and this notebook proceeds in the spirit of early exploration &ndash; and nothing more! The Gaia catalog consists of over a terabyte of measurements available to query and download at the \nGaia archive. As a billion stars is a bit much to blithely pull into the brow"},{"title":"Sign a PDF and Adobe: Go F* Yourself","description":"Allows super-imposing an image of your signature on a PDF. ** Note: you can also do this using Mac Preview, see Tools > Annotate > Signature (docs)** Why not use Adobe? I once had a Adobe subscription exactly for this purpose but I was unable to cancel it. So it cost me $200 to sign a document. They are predatory, and its not just me. Why not use the free tools on the internet? I want to sign financial documents and privacy is critical. Unfortunately, I cannot audit most free software on the internet. Lack"},{"title":"Experimental Plot Beeswarm","description":"A beeswarm takes points along an axis, and gently lifts those that are superposed in order to make the chart readable. This experimental Plot plugin uses a forceSimulation to lift the points, and results in a nice symmetric organic layout. Using a force simulation results in a slightly inaccurate chart, as the points will also move along the axis, and not only on the perpendicular direction. An alternative would be to use the dodge function (exercise left for the reader!). Important note : a beewarm plot is"},{"title":"SQLite","description":"Observable has built-in support for SQLite, “a small, fast, self-contained, high-reliability, full-featured, SQL database engine” and “the most used database engine in the world.” Observable’s SQLite client uses sql.js, an Emscripten port of SQLite. After attaching a SQLite file to your notebook, create a SQLite database client by calling file.sqlite(). Here we’ll explore the Chinook sample database which represents a music library. You can also call SQLiteDatabaseClient.open(source), where source is a URL,"},{"title":"Plot Tooltip","description":"Two approaches for easily adding tooltips to your plots Tooltips on all plots Want to add tooltips to all of your plots? Import `plot` from this notebook, then simply set a `title` attribute for any mark in your plot call (note, this apporach only works with `Plot.plot()` calls, not `Plot.MARK().plot()`) To customize the style of the hovered element, specify a `tooltip` property with key-value pairs specifying the desired styles in your `Plot` call: (many thanks to @fil for this implementation! Tooltips on"},{"title":"Integration Test Duration","description":"This template shows how long your integration tests are taking to run, so you can see which jobs take the longest, and how the duration has changed over time. See also the Flakiness template. It uses our GitHub Actions API integration. The example data shows   job runs from the   repository. See this tutorial for a quick overview of how to use this template. Duration by job A suite of integration tests can be broken down into different jobs, which may focus on different parts of the code or different enviro"},{"title":"Hacking Power BI Charts with Plot","description":"Are you a fan of both PowerBI and Observable Plot? Here are some ideas for recreating PowerBI charts with the 🙏almighty Plot🙏!! Waterfall Chart Ribbon Chart It's a variant of Bump Chart which reflects both value and the changes in rank over time. Tornado Chart LineDot Chart Waffle Chart Funnel Chart 🌐ericlo.dev 🐱GitHub Repositories 🐦Twitter"},{"title":"Hexagon grid rounding","description":"If we have points in a hexagon grid represented using “axial coordinates” –   and   coordinates aligned with two grid axes oriented 1/6 turn (60°) apart – we can round to the nearest hexagon with the pseudocode below: def axial_round(x, y):\n    xgrid = round(x); ygrid = round(y)\n    x -= xgrid; y -= ygrid # remainder\n    if abs(x) >= abs(y):\n        return xgrid + round(x + 0.5*y), ygrid\n    else:\n        return xgrid, ygrid + round(y + 0.5*x) Converting from square-grid coordinates With a simple linear tra"},{"title":"Hilbert Curve Plot","description":"A simple representation of the Hilbert curve, calculated with d3-hilbert and rendered with Plot. Stacking Plots When you stack several orders of Hilbert curves on top of each other the pattern between orders can be a bit clearer. It helped me to notice the multiples of 4, and how each level \"up\" creates 4 corners of a box surrounding a point at the level below. This is just for fun 💅 NYC subway colors Dependencies"},{"title":"Making Maps out of Emojis","description":"I wrote a pretty long writeup below, since my teaser tweet got a lot of eyes. If this stupid little thing inspires you, read the writeup for ideas. Anything is possible with code and that's the beauty of code as a creative medium. ❤ ⚠️ it has come to my attention that windows does not play nicely with the flag emojis. I'm working on a fall-back, but in the mean time, apologies if your windows machine makes ugly things here. Primary Controls Secondary Controls Tertiary Controls (you probably don't need to to"},{"title":"Composing viewofs with the view literal","description":"Lets make custom UIs on Observable easy by composing views. We wrap the amazing hypertext literal with a interceptor that looks for key, view arguments. It uses the key to determine what field to map the view's value to in the container. The syntax of a 2 element array is inspired by Object.entries(...). By reusing the hypertext literal you are able to build your custom ui view using HTML, the best abstraction for layout. Because view itself is a viewof, finally, we can hierarchically build up custom views"},{"title":"COVID Infection and Vaccination","description":"Press Play to visualize the portion of the United States with COVID infections or vaccinations for each day since the pandemic began. Data Sources Vaccination data from Our World in Data Case data from The New York Times Infection estimates from covid19-projections.com by Youyang Gu Note: This site stopped updating their projections in March. I've used their final case to infection rate of 2.5 to model infections since then. Special Thanks to Jacob Rus, Fati Chen, Fabian Iwand and Alex Garcia for advice and"},null,{"title":"Hacking Observable's new Cell Modes to use SQL","description":"2021-12-01 Update: Rejoice! Observable now has SQL cells as a proper feature. You should use that instead of this \"hack\" Update: This has been extended to other technologies! Python (from Chris Zubak-Skees!) CSS WebGL/shaders Preact/htm/JSX Graphviz Logo (from Zeke Nierenberg!) Update #2: Fati Chen crafted a clever way to embed multiple custom cells with this hack! Observable's new Cell Modes feature is really cool! And with a little hacking, you can use it to write SQL in Observable cells, that actually fe"},{"title":"Introducing Dataflow, a self-hosted Observable Notebook Editor","description":"Dataflow is a new tool that lets you run, edit, and compile Observable notebooks locally on your own computer, with any text editor you want! If you have ever wanted to save + run Observable notebooks as files on your computer (for easier integration with git), then Dataflow will be very helpful! Quickstart Check out the documentation for more! In Dataflow, Observable notebooks are files on your computer, with a \\`.ojs\\` extension by convention (to distinguish Observable JavaScript from other JavaScript fil"},{"title":"Simplex Stacks","description":"You may have heard of Simplex Noise, you can find many amazing visuals using it on Observable. But have you ever seen a stacked area chart of Simplex noise? This notebook does just that, using Plot to visualize the noise in a number of familiar and unfamiliar ways. Try changing the \\`z\\` parameter to see the noise in action: The data samples the simplex function primarily along the x axis. Each series in the stack is sampled at a single y value. You can control the \"resolution\" of both x and y with the slid"},{"title":"Observable Plot: Box","description":"This notebook demonstrates how to use composite marks (arrays of marks) and transforms to create a box plot using Observable Plot. These functions (boxX and boxY) define a composite mark suitable for a box plot, applying the necessary\nstatistical transforms. The boxes are grouped by y or x, respectively, if present. This map function returns only outliers, returning NaN for non-outliers (based on the whisker definitions below). These statistical functions take an array of numbers (computed by the reduce tra"},{"title":"Timeline controls","description":"We present a collection of zoomable timeline inputs that can be used to control and visualize a video, an animation or other temporal data. Timelines Mouse-scroll when hovering the timelines to zoom in or out, and click to select the time (and update the control's value). They can be imported from this notebook: See the details of every control: ruler springRuler thumbnails buttons intervals points stack For example, they can be used to navigate to a particular frame in a video: Video Time Zoom The zoomable"},{"title":"Observable Plot","description":"Observable Plot is a free, open-source JavaScript library to help you quickly visualize tabular data. It has a concise and (hopefully) memorable API to foster fluency — and plenty of examples to learn from and copy-paste. In the spirit of show don’t tell, below is a scatterplot of the height and weight of Olympic athletes (sourced from Matt Riggott), constructed using a dot mark. We assign columns of data (such as weight) to visual properties (such as the dot’s x), and Plot infers the rest. You can configur"},{"title":"Introducing Observable Plot","description":"We are thrilled to announce Observable Plot, a new open-source JavaScript library for exploratory data visualization. Observable’s mission is to help everyone make sense of the world with data. To succeed, we need to make visualization easier and faster, both to learn and to practice. Less chore, more joy. We believe people will be more successful finding and communicating insights if they can “use vision to think” instead of wrestling with the intricacies of programming. With its concise and (hopefully) me"},{"title":"Network efficient SQLite querying from static file hosting.","description":"Just saw https://phiresky.github.io/blog/2021/hosting-sqlite-databases-on-github-pages/ and wanted to see if we could do it here. This is extremely cool, a 600MB sqlite database file is hosted on static storage, and we can issue SQL queries, but only a small amount of data is transfered! Yet no backend is really running, its exploiting HTTP range queries. Amazing work Phiresky Here I am query data from a Google Cloud bucket provisioned using https://observablehq.com/@endpointservices/storage though I had to"},{"title":"D3 Force Along a Path","description":"Implements a custom force for d3-force which moves nodes along an SVG path. \"Track strength\" vs \"Max step size\" At each simulation step (\"tick\") a node is moved towards its target position on the path. The further a node is from its target, the more distance it will cover during a tick.  \nThe \"Track strength\" multiplier (\\`strength\\` option) gets applied to this distance. A value of \\`0.5\\` means that the node will cover half the remaining distance towards its target on each tick. \"Max step size\" (\\`clamp\\`"},{"title":"Store Files with Storage","description":"At last, upload files! First, provision a \"bucket\" to hold your files. Once logged in you can upload and download files using a storageClient. You login with an IndieWeb identity URL, which needs to be linked to an observableProfile to upload and list files. Files uploaded to the /public prefix can be accessed from anywhere without login. These are real Google Cloud Storage buckets accessed through Firebase Storage (including its authorization rules). For power users, it is possible to customize the access"},{"title":"XKCD Types of [academic] papers generator","description":"Fill in the fields, then right click on the image to save it, or click on the three dots on the top-left of the image and click \"save as PNG\" Sources Image here https://xkcd.com/2456/ Font there https://github.com/ipython/xkcd-font"},{"title":"Download the shape of a country","description":"Select a country (or Antartica) #### Settings You think France is weird? Maybe look at Map Template France Lambert-93 or d3-composite-projections instead. Also, the precision is very bad for small countries. Credits Developed by Sylvain Lesage Data from Natural Earth. Code from Countries by area by Mike Bostock. ### CHANGELOG 2021/04/30: settings: margin 2021/04/29: published ### TODO empty ### Code ### Data ### Dependencies"},{"title":"Bird Songs","description":"A twitter post from the USGS on National Audubon Day led me to this treasure of bird information from the USGS! I used the information on this page and turned the list of song links from the tweet into a gallery of bird images with the song of each bird attached. You can click on a bird to go to its USGS information page for identification tips or maps. Play many bird songs at a time for a beautiful bird symphony! Enjoy! <font size=\"2\">Two birds are missing images from their USGS infocenter page, the Chimne"},{"title":"Resources from the Earth Day Call","description":"Hello everyone, and thank you for your interest and participation in our Earth Day discussion.  Because we cherish the Earth, I invite your continued engagement to work through environmental data and to better understand our world&mdash;together. The kick-off discussion was very impressive.  Below are resources highlighted during the 1.5 hour chat on data visualization and environmental data sources. This is a work in progress, and it can use your help! The following notes are in more-or-less chronological"},{"title":"Observable TimeChart","description":"TimeChart is an importable component for visualizing time-series data. It can show many signals time-aligned as space-efficient horizon charts. If you hover over a chart, all charts on the page show the value at that time, aiding interpretation. To use in your notebook: Then, call TimeChart and TimeAxis to create charts as described below. Configuration TimeChart expects a consistent x-axis across plots so that you can see coincident patterns. TimeChart also expects exactly one data point per pixel to maxim"},{"title":"Observable TimeChart","description":"TimeChart is an importable component for visualizing time-series data. It can show many signals time-aligned as space-efficient horizon charts. If you hover over a chart, all charts on the page show the value at that time, aiding interpretation. To use in your notebook: Then, call TimeChart and TimeAxis to create charts as described below. Configuration TimeChart expects a consistent x-axis across plots so that you can see coincident patterns. TimeChart also expects exactly one data point per pixel to maxim"},{"title":"Procedural Face Exploration","description":"This is a copy, with only very slight modifications, of the excellent Procedural Face Generator written by Amit Patel. I wanted to play around with some of the facial features so I ported it into Observable, but you should check out the original (especially the cool sliders that help understand how changing the parameters will change the face 😍)! It's interesting to explore how the face color, eye shape, and the addition of eyelashes change the way the face looks."},{"title":"What story do two decades of weather data tell you?","description":"What story do two decades of daily weather data tell you? You are about to find out 😊. As usual, I picked these five major cities across 1000 miles of the US West Coast. The top part of the graph contains two stacked column charts. The left one represents the temperature distribution of the current month, and the right one shows weather condition distribution. The line chart visualizes the temperature trend; as you hover across the chart, a reference line will follow along with high/low temperatures appear"},{"title":"Federated IndieAuth Server","description":"Introduction This notebook is an authentication server [okta, auth0, wikipedia]. It implements a generic Oauth 2.0 authorization_endpoint and token_endpoint. This is a technology that can enable a user to login to a service and execute private operations. You need one of these to build secure services. Leading commercial services include Okta, Auth0, Firebase Auth, AWS Cognito. Leading Open Source solutions include Keycloak. This particular authorization server uses IndieAuth/relMeAuth. This differs from mo"},{"title":"Plotting a Javascript function with functionplot","description":"Suppose we have the following function defined as a bit of Javascript code: Here's how to plot it with functionplot:"},{"title":"Ouroboros","description":"It all started with yet another loop made with Threejs and my new bnbThree tool. It felt like I had unlocked some superpowers from Jaume Sanchez Elias, though I knew this could not run in real time, until this: And then followed an amazing ThreeJS lesson (have a look at the whole thread): And here is the result live in the browser, running realtime and interactive: Imports"},{"title":"World Grids","description":"1. Data Import 2. Map Layout ** 3. Grids**"},{"title":"Chat application with Firebase on Observable (Twitch)","description":"This is the notebook I used when doing an Observable Twitch stream! None of this will work unless you signin at the bottom because we added security :) However, I had added the option to signin in anonymously so you don't need to give up your email address. Its useful to assign SDK services to variable so autocomplete works Basics Write some data Read a snapshot in time: Read a collection at a snapshot in time Read a doc AND update in realtime. Use list to bind a location to a cell, and have all the nice da"},{"title":"Aires d’accueil des « Gens du voyage »","description":"Export officiel, par @visionscarto, des données collectées par William Acker dans le cadre de l’inventaire critique publié sous le titre «&nbsp;Où sont les “gens du voyage”&nbsp;?&nbsp;». URL de référence : https://visionscarto.net/aires-d-accueil-les-donnees (Date de mise à jour&nbsp;:  ) \\\\* Les aires d’accueil sont classées par grandes caractéristiques : aires d’habitat, de petit passage, de grand passage (GP). Téléchargement Vous pouvez télécharger les données (fichier au format CSV) en cliquant sur le"},{"title":"Raytracing in 40 minutes, the Observable port","description":"This is an ObservableHQ port of the \"Raytracing in 40 minutes\" from Peter Shirley, one cute feature is that when you update any of the values of this port, it automatically updates all the renderings as you change the functions and variables in this file. Peter announced that he would be doing a short lecture explaining this on his twitter feed. 3D Vectors and Colors in this notebook are represented as arrays of three values, there is no special data type for it.   The dimensions of the images are controled"},{"title":"Evenly-Spaced Sampling","description":"Say you have an array of   ordered elements and you want to select   of them, evenly-spaced. If   is a divisor of  , you can select every   element where  . For example if you have   elements and want  , select every other element. Here’s a more general approach suggested by Jonathan Helfman. And here’s an example. Try editing the number of samples below to see how the algorithm behaves."},{"title":"Simple pencil + ink pen effect for SVG path using filters","description":"<img width=\"700px\" src=\"https://astrofella.files.wordpress.com/2019/12/mouse.jpg\"> \"By Quentin Blake\" This is a simple way to do a pencil or ink pen effect for an SVG \\`\\`<path>\\`\\`, using the \\`\\`<feTurbulence/>\\`\\` noise filter. For more pencil effect examples on Observable, have a look at @matthewturk/pencil-effect-filters, and which also simplify and curve the path    @coreygirard/pencil-mercator, @d3/sketchy-earth and @visionscarto/pencil-globe. Take an SVG path (no filter applied): Higher frequency no"},{"title":"Let's 3D the D3 Circle Packing","description":"Looks familiar? Yes, this is a 3D representation of Mike Bostock's Circle Packing in the bird's eye view and it's zoomable😉. You can rotate, dolly and pan to see the circle-packing from different angles, or double click on a block to move the camera closer to it (double click on empty space to reset the camera). Cameras and scenes OrbitControls Renderer User Interactions Tooltip Visual Elements Pooling resources here is an extremely useful technique that can dramatically increase performance and reduce mem"},{"title":"Bit Field Patterns","description":"A few of the interesting variations mentioned in the thread: \\`\\`\\`\n(x ^ y) % z (Alien art)\n(x | y) % z (Sierpinski triangles)\n(x * y) & z (Circular patterns)\n(x ^ y) < z (Steps)\n(x * z) % y (Beams)\n\\`\\`\\` Many other combinations/orders of operations are interesting, too. Amazing the amount of variation from just changing these few things! Appendix"},{"title":"Rounding polygon corners","description":"In my previous notebook about how to find the union polygon of overlapping rectangles I've included a polygon corner rounding algorithm as a post-processing step but didn't explain how it worked. In the end, rounding arbitrary polygons essentially comes down to solving the&nbsp;following two things: Drawing a circle using cubic bezier curves, there's a catch Placing a point on a line, at some distance from another one Both of these things are pretty easy to do once you know how, but can be daunting if&nbsp;"},{"title":"Women in space 👩🏼‍🚀","description":"Data I parsed the data from the Wikipedia site List of female spacefarers. I manually enhanced the comments section with information from individual Wikipedia profiles of the astronauts and information from the NASA site. Sky image by Max McKinnon on Unsplash. Imports D3, CSS styles and images"},{"title":"Votes for Women: Suffragette Collage Maker","description":"Submission for Observable's Women's History Month DataViz Contest. Thank you to Jacob Rus for his help optimising the code. Political movements generate their own “stuff”: the posters from the the 2017 Women's March (and the Pussyhat), the Brexit tea towel, the gilets of the Gilets Jaunes. The same is true when women were fighting for the vote in the 20th Century. In addition to badges and ribbons, they also made sheet music, games (there was 'Panko' the card game—not related to the breadcrumbs ), suffrage"},{"title":"World Elevation Line Map","description":"1. Data import. We do... ** 2. Data Handling & stuffs for cartography**. Here, we... 3. Lines ** 3. Coordinates to curve**"},{"title":"SVG to GIF","description":"How to convert animated SVGs to GIFs in Observable. This is a brief tutorial about how to create GIFs using the functions in this notebook from @mootari 🙏. As a simple starting place, let's imagine that you want to create a gif of this svg of randomly placed circles: To use the functionality from this notebook, you'll need to take a few steps: Create a \\`render()\\` function that returns a function that takes in a timepoint (\\`t\\`) and returns the svg node Pass the results of the \\`render()\\` function into"},{"title":"Union polygon and area of rectangles (line sweep algorithm)","description":"Given a set of unrotated and potentially overlapping rectangles, we want to compute the total area covered by their union and get their union polygon(s). One way to proceed is to first use a line sweep algorithm in order to subdivide the surface of the rectangles to a set of non-overlaping rectangles covering the same area. In&nbsp;other words, we want the resulting rectangles to be either contiguous or completely separated. Computing the total surface area is then as trivial as suming all the resulting rec"},{"title":"021 Arrangements","description":"A substandard rip-off of Heydon’s System Generated as SVG using SVG.js. The texture is generated using SVG pattern."},{"title":"Guided Tour of an Infinite Sphere Grid","description":"An Exploration of Parameter Space Best viewed in fullscreen landscape mode, if your GPU can handle all the ray marching. Shortcuts: I've split the fragment shader into  small chunks so that I can move the canvas cell next to the chunk I'm working on, to see both the canvas and the code. This would otherwise be difficult when working on GLSL code in the middle of a large cell. Miscellaneous"},{"title":"Tooltip (D3 Convention)","description":"This version of a Tooltip uses the D3JS convention of \\`selection.call()\\` to register the Tooltip's behavior. This is an improvement on my original version of a Tooltip Component. Implementation Chart Helpers Dependencies"},{"title":"Generative Painting","description":"This is a recreation of a generative water colour like painting technique described beautifully by Tyler Hobbs during his \"How to Hack a Painting\" talk in the Strange Loop Conference '17. Also checkout his essay on the same subject on his blog. Color Painting Dependencies"},{"title":"That colorful font","description":"That colorful font from the browser extension, What have you made today? This is the original font face, I think: Type With Pride"},{"title":"Playing with Hilbert","description":"Space filling curves are fractals that weave through every point in space. They're useful when you are building a system that needs to<br/><br/>\\`<twilight-zone-voice>\\`<br />&nbsp;&nbsp;&nbsp;&nbsp;jump dimensions <br/>\\`</twilight-zone-voice>\\`. Let's say you have a piece of string that represents 1-dimentional space. You could mark that string with a sharpie and represent a point. If you were to take your string and lay it out on the floor and make it all squiggled up, you'd have your sharpie point somew"},{"title":"World Bank API - Meet Vega Lite","description":"Big thanks to   Lionel Radisson for showing me how an API works, to   Christoph Pahmeyer for walking me through Vega Lite, and to   Visnu Pitiyanuvath for opening my eyes to the power of this charting library!  Thanks also to   Dominik Moritz for the kind suggestions for improvement! The World Bank Open Data portal is designed to make World Bank data easy to find, download, and use. Data can be used free of charge with minimal restrictions. Data are a subset of those available in the World Bank’s DataBank,"},null,{"title":"PHYLLO FORK 🌻🍴 How much warmer? (BBC)","description":"This is a fork of Fil's notebook. I simply replaced the regular lat/lon grid with a spherical Phyllotaxis sampling. How much warmer? (BBC) A recreation, for educational purposes, of this beautiful map by the BBC Visual and Data Journalism team (31 July 2019). You can learn more on the original project in this very detailed and complete write-up by the BBC team. Made with D3 (the original visualization uses THREE.js). CODE NEW TO THE FORK IS HERE! Since ultimately I'm going to need to interpolate the phyllo"},{"title":"How much warmer? (BBC)","description":"A recreation, for educational purposes, of this beautiful map by the BBC Visual and Data Journalism team (31 July 2019). You can learn more on the original project in this very detailed and complete write-up by the BBC team. Made with D3 (the original visualization uses THREE.js). See also Matt’s version, which uses a phyllotaxis distribution instead of the original’s rectangular grid. boring zone"},{"title":"SVG flowers","description":"I stumbled on this tweet by @wks_jp and since spring is coming, I was inspired to create the same kind of floral patterns using svg \\`stroke-dasharray\\`. There are two patterns that we randomly draw: Variable density dotted path: a \\`stroke-dasharray\\` is used with a 0 length for the stroke so it becomes rounded to evenly spaced circles when \\`stroke-linecap\\` which is set to \\`round\\`. Additionally, using this pattern, the resulting flower may or may not have a solid center drawn. Striped stroke: an arbitr"}]