[{"title":"Poisson distribution generators","description":"A brief history of blue noise 2 dimensions point distributions: dark ages: Monte Carlo, aka “dart-throwing”; very slow 1991: Don Mitchell publishes “Spectrally optimal sampling for distribution ray tracing,” introducing a sequential sampling algorithm which has a time complexity of 2007: Robert Bridson publishes “Fast Poisson disk sampling in arbitrary dimensions”, which improves on Mitchell’s algorithm—now linear time. 2012: Mike Bostock implements Mitchell’s algorithm (it was the time of d3v2 and bl.ocks!"},{"title":"Choropleth color palette tests : poverty in Paris","description":"Source : INSEE, 200m grid, FILOSOFI income data, 2015 : https://www.insee.fr/fr/statistiques/4176290?sommaire=4176305 Appendix"},{"title":"Terrains with MapLibre","description":"MapLibre GL is a community-led fork derived from mapbox-gl-js before their switch to a non opensource license. One of the fancy possibilities of mapbox-gl-js is to display the terrain. This functionality is now also added to MapLibre (version 2.2.0-pre.2). For the terrain and hillshading the demo tiles on https://demotiles.maplibre.org/terrain-tiles/tiles.json are used. The terrain data of Japanese ALOS Global Digital Surface Model “ALOS World 3D - 30m (AW3D30)” is used in this demo. It's also possible to a"},{"title":"Mosaic + @antv/s2 = ???","description":"You can also upload your local image and have fun with it! Get Data Get Data Options Get Chart Options Get Theme Options Dependency"},{"title":"Linear models in Observable notebooks","description":"Following the discussion about statistics in Observable notebooks, this notebook demonstrates how (multiple) linear regression models can be performed in JavaScript. The library used for the regression analysis is still in it's early development, so please leave comments/ideas/suggestions about changes in the API and/or the general implementation or approach! Currently, ml-matrix is used for the linear algebra. In the long run, the library aims to provide reliable and accurate results, on par with R and pyt"},{"title":"Terrains with MapLibre","description":"MapLibre GL is a community-led fork derived from mapbox-gl-js before their switch to a non opensource license. One of the fancy possibilities of mapbox-gl-js is to display the terrain. This functionality is now also added to MapLibre (version 2.2.0-pre.2). For the terrain and hillshading the demo tiles on https://demotiles.maplibre.org/terrain-tiles/tiles.json are used. The terrain data of Japanese ALOS Global Digital Surface Model “ALOS World 3D - 30m (AW3D30)” is used in this demo. It's also possible to a"},{"title":"A Timeline of Democratic Presidential Candidates","description":"Made with Observable Plot—see the original D3 version. Data: Kemper Smith."},{"title":"A Sine-Cosine Encoder Experiment","description":"I'd like to find a good way to measure how fast a wheel is turning when it's moving slowly. In this experiment, I used two phototransistors to measure the light passing through an encoder wheel. Here's what it looks like: You can see two LEDs on this side of the wheel, and there are two sensors on the opposite side. As the wheel turns, the gratings in the wheel shadow the sensors from the LED light. They're spaced so that the shadows happen at different times, about 90 degrees out of phase. (Here are the CA"},{"title":"Workshop Materials: Exploratory Data Analysis","description":"This workshop introduces a browser-based data analysis workflow on Observable using Observable Plot. It covers loading, visualizing, and interacting with data. Follow along with the video above using the interactive prompts below! Each prompt in the workshop has a corresponding Show me cell containing the code and expected results: Loading data We have prepared a database that we can connect to using Observable's SQL cells. We will explore the eCommerce Demo Data and attempt to understand the revenue over t"},null,{"title":"Evolution of Covid deaths since the start of the pandemic","description":"Heatmap-style geographic-sorted chart for STAT News The following chart was produced for a story I wrote for STAT News entitled The ‘five pandemics’ driving 1 million U.S. Covid deaths. Data analysis and visualization for this story were done by me. The story was edited by Laura Chang. I also wish to thank Helen Branswell for her feedback in working on the story. For final presentation, annotations and style tweaks to the chart below were made using Adobe Illustrator. The code below has been excerpted from"},{"title":"Hohmann Transfer Orbit","description":"This is a demonstration of a satellite executing a Hohmann transfer orbit to move between two approximately circular orbits. The forces applied were derived via guess-and-check, as I continue to learn how orbits work. Plan Details A scale factor of   is applied to masses and forces to produce sensible values on a small scale. The planet's mass is   and the satellite's mass is The satellite produces thrust according to the rows written in `plan`. Each row in the `plan` specifies a `timestamp`, `angle`, and `"},{"title":"Grouped Tracks","description":"Text length affects layout. Interaction Binding Scroll Motion Tooltip LEGEND Color Switching based on background LAYOUT Groups Tracks Timeline Marks Tooltips Utility/Helper WorkSpace SETUP SCALES DATA ANX Mark Cutout Marks are not visible over the red region"},{"title":"Floating Point Calculator","description":"Calculate IEEE-754 style floating point numbers with arbitrary precision (`p`) and range (`q`). Enter as decimal aproximation, hex, or click to modify the binary digits Deconstructed Representation bias/min/max implementation details The implementation of `toFloat` is very slow for high `q`, so we set a maximum of 12"},{"title":"Hello MapLibre","description":"MapLibre GL is a community-led fork derived from mapbox-gl-js before their switch to a non-OSS license. Documentation available here. Examples available there. To start, you just have to load the maplibre js library and a CSS file. 1. Display a map (Paris, France) 2. Add a Marker 3. Add a geojson file (submarine cables) NB: TeleGeography's submarine cable map is based on our authoritative Global Bandwidth research. The map depicts active and planned submarine cable systems, their landing stations, cable len"},{"title":"Force-Directed Graph","description":"A version of the Force-Directed Graph that add supports for: both SVG and Canvas in the same interface. conditionally drawing the links only when a certain alpha is reached (useful for large graphs) if you pass `_this:this` it will redraw on the same graph, useful for keeping the same value while changing parameters Title doesn't work on canvas. This network of character co-occurence in Les Misérables is positioned using D3’s force layout. Color represents arbitrary clusters in the data. Drag nodes below to"},{"title":"DarkCideS: Bats in Caves Data","description":"Analysis friendly scientific data DarkCideS is a collaborative open-access data-sharing platform for global cave-dwelling bat ecology and conservation. The datasets are published as 4 CSV files which have been attached to this notebook for convenience. This dataset has several nice properties: It has real-world scientific value It is not overwhelmingly large It is tidy with several categorical dimensions It has a geographic component In this notebook we demonstrate several queries and visualizations for get"},{"title":"Reproductive rights and ... ??","description":"With the recent Supreme Court leak concerning Roe v Wade, I thought it might be a good time to explore how a respect for reproductive rights correlates with other health care indicators. This visualization is the result. We measure \"respect for reproductive rights\" using the reproductive rights score (or rr-score) from Status of Women in the States. With no covariate chosen, the map below is simply shaded according to that score and the histogram shows the prevalence of states with various rr-scores. You ca"},{"title":"Cartographie de l'élection présidentielle 2022 au niveau communal","description":"Cette carte montre les résultats de l'élection présidentielle 2022 au niveau communal. Ce niveau permet de mieux percevoir les variations locales du vote, en particulier entre différentes régions, milieu rural ou urbain, etc. Les données peuvent être représentées sous forme de régions ou bien de cercles proportionnels, pour l'ensemble des candidats (sous forme de rayures) ou uniquement le candidat arrivé en tête. Les données des deux tours sont disponibles. Le niveau de l'abstention et votes blancs/nuls peu"},{"title":"Interactive Sequence Diagrams","description":"I am pleased to discover the Mermaid diagrams animate quite well. This lets the reader walk through the sequence at their own pace, and provides additional opportunity for the author to explain steps in details. Yes the example is weird but it comes from the Mermaid documentation"},{"title":"Analyzing Star Wars movies + the first anniversary of Observable Plot!","description":"<img width=\"110%\" src=\"http://cdn.mcauto-images-production.sendgrid.net/9512743694f5796e/a41ce9fc-ac79-4ccf-a8a6-8fc27dd0d195/1280x800.png\"> On May the 4th of 2021, we introduced Observable Plot to the world with a special live-coding data visualization session. Visnu Pitiyanuvath, Software Engineer and one of our resident Star Wars experts at Observable, led our team in a rapid-fire data exploration of Star Wars movie scripts. DataViz Developers Ian Johnson and Mike Freeman supported Visnu in his quest to"},{"title":"Heroku - keystroke-observablehq","description":"Live at <a href=\" \" target=\"_blank\">keystroke-observablehq.herokuapp.com</a> This notebook implements a \"serverless function platform\" to run named cells in any public notebook belonging to the configured user (inspired by the serverless cells project by Tom Larkworthy). It is being run from a small nodejs host application, the code for which is available on Github: index.mjs\n\\`\\`\\`js \\`\\`\\` From the above code, you can see that we'll import this notebook, wait for the named cell 'main' to resolve, and then"},{"title":"Some JavaScript features","description":"This was created as a demo of some newer JS features for a cohort of backend engineers, many of which had not written JS for some time. Template literals Tagged templates This makes template functions an immensely flexible construct. We can, Iteration protocols The iterator protocol defines a standard way to produce a sequence of values (either finite or infinite), and potentially a return value when all values have been generated. An object is an iterator when it implements a `next()` method with the follo"},{"title":"Top Dataviz of April 2022 - Visualizing Air Raid Sirens in Ukraine","description":"This month, our Trending Notebook Bot saw huge engagement with Volodymyr Agafonkin\n's notebook Visualizing Air Raid Sirens in Ukraine. It's the biggest hit of the year so far. Engagement, Impressions, Likes and Retweets The notebook went viral on Twitter from Volodymyr's own tweet. This went viral because it's provides a unique angle to a story people are interested in. Volodymyr collected the data with a bot scraping for regional Telegram air raid alerts. The dataviz makes an emotional connection to the vi"},null,{"title":"Biological Motion Walker Demo","description":"Based on the notebook by @mythmon.  \nwith help from observable Talk, @mootari, @enjalot and @mbostock https://github.com/tetunori/BMWalker.js  by https://twitter.com/tetunori_lego https://www.biomotionlab.ca/projects/  \nDecomposing biological motion: A framework for analysis and synthesis of human gait patterns. ALT text: Human body points, Head, Belly, Clavicles, Left and Right Ankles, Elbows, Hands, Hips, Knees, Shoulders are represented by circles on a y and x chart.  \nThe size of the circle represents t"}]