[{"title":"Wildfire Storytelling: How does Vorticity-driven Lateral Spread happen?","description":"Background The 2022 SciVis Contest is dedicated to understanding the evolution of wildfires, specifically the vorticity-driven lateral spread phenomena and the impact of various factors in the spread progression. In this project, we propose to: Present a summary of the data and visual narrative of the wildfire events. Analyze how different terrain, specifically curvature of the mountain ridge and the intial fire iginition region can make the spread event differently. Analyze the correlation of different var"},{"title":"Version Locking for Notebook Imports","description":"Your Observable notebooks go through different versions, like different versions of a document. You can see these versions by clicking on the Version history icon: <svg width=\"16\" height=\"16\" viewBox=\"0 0 16 16\" fill=\"none\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M8 14C11.3137 14 14 11.3137 14 8C14 4.68629 11.3137 2 8 2C4.68629 2 2 4.68629 2 8C2 11.3137 4.68629 14 8 14ZM8 16C12.4183 16 16 12.4183 16 8C16 3.58172 12.4183 0 8 0C3.58172 0 0 3.58172 0 8C0 12.4183 3.58172 16 8 16Z\" fill=\"currentColor\"><"},{"title":"How much taller are men than women?","description":"Globally, the mean height of women is about four and a half inches, or 12 centimeters (cm), shorter than that of men. In the latest available data, the global mean height for men was 171 cm, versus 159 cm for women. This height disparity between the sexes is present everywhere in the world. It’s largest in North Macedonia, where men are typically 18.5 cm taller than women, and smallest in The Gambia, where the mean difference is only 4.5 cm. https://ourworldindata.org/human-height The challenge was 3D.. in"},{"title":"The MoMA Collection Data","description":"Metadata and thumbnails of over 100,000+ modern artworks MoMA publishes their collection data on Github. The data contains detailed metadata on over 100,000 works by more than 15,000 artists from around the world spanning 150 years. Using the data The dataset has been prepared as a SQL database with DuckDB that you can access You can import this dataset into your notebooks directly like so: The Apache Parquet files are loaded using DuckDB, a client-side database that can be thought of as a more powerful and"},{"title":"Main causes of death in Europe","description":"This map shows the main causes of death in Europe. This is an example of Dorling cartogram using striped circles to represent proportions as proposed here. Circles Define stripe patterns Set circle radius Background regions Legend Info box Optimisation Statistical data Colours Geometries Libraries"},{"title":"Snap A Slider To Values","description":"A helper that adds snap offsets to a range input, roughly similar to datalist. Tickmarks are not set due to a lack of cross-browser support. Features: specify start and end value for each snap range ignores input events that are triggered via keyboard. Import: Examples Snap to 0, 1, 2, 3 and 4 within ± 0.2 each: Snap to 1, 2 and 3 within + 0.5 each: Snap to 0, .5 and 1 within ± 0.1 on a native range input: Implementation"},{"title":"GeoParquet on the Web","description":"The ideal Cloud-Native analytical geospatial vector file format Kyle Barron\n</br>\nFoursquare The Web is the future of Geospatial Web applications are accessible to anyone and easily shareable No installation issues like with some desktop applications Possible to get near-native performance with tools like WebAssembly and WebGL Bandwidth is the browser's limiting factor for large data Modern geospatial applications can support  that wants to support large data files. There are three common techniques for mak"},{"title":"Observable’s Security Model","description":"Observable provides a secure environment for working with private data. This notebook details how Observable restricts access to sensitive resources including secrets, databases, files, and other notebooks. Before we dive in, here are two important principles you should remember when writing private notebooks: Only import or copy-paste code that you trust. Imported code is evaluated in the same JavaScript context as the rest of the notebook (that is, within the same sandbox, as explained below). If you `imp"},{"title":"Edge Distance in Regular Polygons","description":"Demonstrates how to calculate the edge distance to center for any given angle in a regular polygon. For linear interpolation between vertices see Polygon Sine Wave. Changelog 2022-04-23: Removed radius argument."},{"title":"Day 11 - circular #30DayChartChallenge","description":"Esse notebook faz parte da construção da visualização do #30DayChartChallenge. (This notebook was created to build data visualization for the #30DayChartChallenge.) <img src=\"https://github.com/30DayChartChallenge/Edition2022/raw/main/img/prompts-full.png\" width=\"100%\" /> Maiores informações: https://twitter.com/30DayChartChall (More information at: https://twitter.com/30DayChartChall) A visualização Configurações de dimensões, cores e textos Gráficos Dados Dados extraídos do Our World in Data no link: http"},{"title":"The Google 'VS' trick","description":"Outsource tedious research to the hive mind. This tool implements the Google Search 'VS' trick to find common alternatives to things. Starting with a term like 'Poodle', we ask Google for search suggestions of 'Poodle VS' which will find alternatives to poodles that people often consider on the internet. This can be used to perform basic market research (e.g. find me React alternatives), medicine (find me ibuprofen alternatives) and product choices (Peloton alternatives) it will even find you choices for ph"},{"title":"The Little Mermaid Example (Disney version)","description":"Observable recently added the mermaid template literal to the Observable standard library to ease the creation of flowchart-type diagrams and visualizations.  See Mermaid for more examples, but here is an example inspired by Part of Your World, by Howard Ashman & Alan Menken. Ariel's Flowchart"},{"title":"Ridgeline Plot 2 / Observable Plot","description":"This variation of a ridgeline plot uses a variable color encoding that is redundant with y, the vertical position of the area topline. Data: Moritz Klack"},{"title":"RadViz","description":"Normalize the data   to interval  , Place the dimensional anchors  , where  <br> , Calculate the points   where to place each record, <br> . Standard RadViz Draggable dimensional anchors \"RadViz Deluxe\" uses MDS to project  , after projection a Hamilton Circle is searched, which defines then the position of the dimensional anchors. \"RadViz Deluxe\" goes then one step further, in improving the positions of the points, to reduce the \"Attribute Layout Error\". Here, I used MDS to project   and normalized the pol"},{"title":"Visualizing Air Raid Sirens in Ukraine","description":"As Ukraine continues to heroically resist Russia's invasion, Ukrainians have to face new realities of war. One of them, a constant presence in our daily lives, is Air Raid Sirens — a loud sound indicating the threat of imminent attack from the air and a call to take shelter immediately. In the digital age, instead of loudspeakers, most people rely on mobile apps like Air&nbsp;Alert, which allows you to choose a region and get emergency alerts for it. It also has a Telegram channel which doubles the alerts."},{"title":"Day 4: Cherry Bloom Calendar","description":"Note: the following visual works best on chrome and may have some issues on other browsers due to it's use of certain svg filters Houskeeping"},{"title":"Virtual Water Trade (Wheat)","description":"A representation of wheat trade as virtual water. Virtual water trade (also known as trade in embedded or embodied water) refers to the hidden flow of water if food or other commodities are traded from one place to another. (...) When a country imports one tonne of wheat instead of producing it domestically, it is saving about 1,300 cubic meters of real indigenous water. -- from Wikipedia. The present diagram shows the global flows of \"virtual\" water observed in wheat trade. Footprint type: * *. Exports are"},{"title":"PolyLabel","description":"Modified version of polylabel based on Frank Brill's enhancements. This version tidies up some of the JavaScript code, increases flexibility of input polygons and adds some examples for working with Topo/GeoJSON objects. Given a polygon comprising in the form `[[x0,y0], [x1,y1], ...]` or a multi-polygon in the form `[[[r0x0,r0y0], [r0x1,r0y1], ...],[[r1x0,r1y0], [r1x1,r1y1], ...], ...]`, find the largest incircle that can be placed without crossing any boundaries. The result is a single array in the form `["},{"title":"049 Dots and lines","description":"Imports Credits Playing with method of Voronoi Tessellations by George Francis."},{"title":"Plot.stereoHistogram","description":"The best way to make a histogram stand out. To be honest, these autostereograms are super difficult to see. Based on the implementation by https://github.com/peeinears/Stereogram.js"},{"title":"Understanding Linked Art","description":"With the Getty Collection API This is the first tutorial in a series. Check out the second and third installments! This is the first of three tutorials for working with Linked Art data in Observable notebooks. Linked Art is a community of museum professionals and cultural heritage researchers that is working to create a shared model, a metadata application profile, for cultural heritage objects. Basically, Linked Art defines a metadata standard for storing information about cultural heritage in line with Li"}]